




# Practical-2
Aim: Perform Descriptive statistics on given data sets.

**toyota data**

In [ ]:
import pandas as pd

df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/prac1/Toyota.csv')
df

    Unnamed: 0  Price  Age     KM FuelType
0            1  13500   23  46986   Diesel
1            2  13750   23  72937   Diesel
2            3  13950   24  41711   Diesel
3            4  14950   26  48000   Diesel
4            5  13750   30  38500   Diesel
..         ...    ...  ...    ...      ...
91          96  19950   17  30351   Diesel
92          97  15950   19  29435   Petrol
93          98  15950   19  25948   Petrol
94          99  18750   11  24500   Petrol
95         100  17450   18  23902   Petrol

[96 rows x 5 columns]

In [ ]:
df.mean()

Unnamed: 0       49.822917
Price         17169.104167
Age              25.593750
KM            39941.250000
dtype: float64

In [ ]:
df.loc[:,'Price'].mean()

17169.104166666668

In [ ]:
df.median()

Unnamed: 0       49.5
Price         16897.5
Age              26.0
KM            34065.5
dtype: float64

In [ ]:
df.loc[:,'Age'].median()

26.0

In [ ]:
df.std()

Unnamed: 0       29.028115
Price          2418.395159
Age               4.027741
KM            20306.152094
dtype: float64

In [ ]:
df.loc[:,'Age'].std()

4.027740975835096

In [ ]:
df.mode()

    Unnamed: 0    Price   Age       KM FuelType
0            1  15950.0  22.0  28000.0   Petrol
1            2      NaN  27.0  43000.0      NaN
2            3      NaN   NaN      NaN      NaN
3            4      NaN   NaN      NaN      NaN
4            5      NaN   NaN      NaN      NaN
..         ...      ...   ...      ...      ...
91          96      NaN   NaN      NaN      NaN
92          97      NaN   NaN      NaN      NaN
93          98      NaN   NaN      NaN      NaN
94          99      NaN   NaN      NaN      NaN
95         100      NaN   NaN      NaN      NaN

[96 rows x 5 columns]

In [ ]:
df.var()

Unnamed: 0    8.426315e+02
Price         5.848635e+06
Age           1.622270e+01
KM            4.123398e+08
dtype: float64

In [ ]:
df.loc[:,'Price'].var()

5848635.146929827

In [ ]:
df.skew()

Unnamed: 0    0.023116
Price         0.558603
Age          -0.638079
KM            1.156940
dtype: float64

In [ ]:

from scipy.stats import iqr

iqr(df['Age'])

6.25

In [ ]:
df.describe()

       Unnamed: 0         Price        Age             KM
count   96.000000     96.000000  96.000000      96.000000
mean    49.822917  17169.104167  25.593750   39941.250000
std     29.028115   2418.395159   4.027741   20306.152094
min      1.000000  12950.000000  11.000000    7000.000000
25%     24.750000  15750.000000  22.750000   27112.000000
50%     49.500000  16897.500000  26.000000   34065.500000
75%     74.250000  18750.000000  29.000000   48347.250000
max    100.000000  22750.000000  32.000000  110404.000000

In [ ]:
df.describe(include='all')

        Unnamed: 0         Price        Age             KM FuelType
count    96.000000     96.000000  96.000000      96.000000       89
unique         NaN           NaN        NaN            NaN        2
top            NaN           NaN        NaN            NaN   Petrol
freq           NaN           NaN        NaN            NaN       71
mean     49.822917  17169.104167  25.593750   39941.250000      NaN
std      29.028115   2418.395159   4.027741   20306.152094      NaN
min       1.000000  12950.000000  11.000000    7000.000000      NaN
25%      24.750000  15750.000000  22.750000   27112.000000      NaN
50%      49.500000  16897.500000  26.000000   34065.500000      NaN
75%      74.250000  18750.000000  29.000000   48347.250000      NaN
max     100.000000  22750.000000  32.000000  110404.000000      NaN